//
//  EMapDetailViewController.swift
//  Beipu
//
//  Created by 陳Mike on 2022/8/4.
//

import UIKit
import SafariServices

class EMapDetailViewController: UIViewController {
    
    @IBOutlet weak var imageView: UIImageView!
    @IBOutlet weak var titleLabel: UILabel!
    @IBOutlet weak var descriptionView: UIView!
    @IBOutlet weak var descriptionLabel: UILabel!
    @IBOutlet weak var addrLabel: UILabel!
    @IBOutlet weak var phoneLabel: UILabel!
    @IBOutlet weak var phoneButton: UIButton!
    @IBOutlet weak var facebookLabel: UILabel!
    @IBOutlet weak var facebookButton: UIButton!
    @IBOutlet weak var shopButton: UIButton!
    @IBOutlet weak var shopStackView: UIStackView!
    
    var index = 0
    var sid = String()
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        initView()
        let store = storeList[index]
        titleLabel.text = store.0
        imageView.image = UIImage(named: store.0)
        descriptionLabel.text = store.2
        addrLabel.text = store.1
        phoneLabel.text = store.3
        phoneButton.setTitle(store.3, for: .normal)
        facebookLabel.text = store.4
        facebookButton.setTitle(store.4, for: .normal)
        shopButton.setTitle(store.4, for: .normal)
        shopButton.setTitle(store.7, for: .normal)
        
        if store.7.count == 0 {
            shopStackView.isHidden = true
        } else {
            shopStackView.isHidden = false
        }
    }
    
    func initView() {
        imageView.addCornerRadius(8)
        descriptionView.backgroundColor = .themeLightBlue
        descriptionView.addCornerRadius(8)
        descriptionLabel.textColor = .black
    }
    @IBAction func googlemapButtonTapped(_ sender: UIButton) {
        openWithGoogleMap(indexPath: index)
    }
    @IBAction func phoneButtonTapped(_ sender: UIButton) {
        callPhoneNumber(indexPath: index)
    }
    @IBAction func facebookButtonTapped(_ sender: UIButton) {
        openWithSafariFacebook(indexPath: index)
    }
    @IBAction func shopButtonTapped(_ sender: UIButton) {
        openWithSafariShopLink(indexPath: index)
    }
    
    //店家名、地址、敘述、電話、Facebook、lat、lon、商城、sid
    let storeList: [(String, String, String, String, String, Double, Double, String, String)] = [
        ("", "", "", "", "", 0, 0, "", ""),
        ("北埔第一棧",
         "新竹縣北埔鄉水磜村31之1號",
         "民國九十一年，從原本的光君製茶廠，改建成現在這種客家唐式風格建築，取名北埔第一棧，讓客家美食與茶文化更多元豐富。北埔第一棧在吃的文化上，除酸、鹹、香一貫的客家菜特色外，也發展出令人讚嘆垂涎的料理，如金桔入菜與膨風茶入菜等，都是極具地方特色的客家美食。另外，特色膨風茶之產製和銷售，是近年北埔鄉對外的一項主要文化產業，亦是地方重要的經濟來源，「北埔第一棧」為北埔產茶勝地，開設膨風茶文物館，配合四周觀光茶園、果園、客家歷史古蹟、水域遊憩設施等，亦成為遊客想了解北埔鄉茶業的遊憩據點重心，更能吸引國內遊客甚至國際觀光客之注意。北埔第一棧在客家文化的傳承與發揚一直在北埔站在領先的地位，我們希望用認真傳承的心，永續經營這樣的一塊寶地。",
         "03-5803131",
         "https://www.facebook.com/kcft.tw",
         24.7123914,
         121.0621749,
         "",
         "247"),
        ("福美軒飲食店",
         "新竹縣北埔鄉北埔村南興街132號",
         "本店開業至今已長達三十年的歷史，早期第一代是以外燴為主，現在第二代接手營業項目以辦桌、喜宴、外燴、自助餐為主，隨著時代環境的變遷，店內重新裝潢後開始經營團體訂餐(開會、聚餐).便當訂做、經濟快炒、客家小吃，可說是一家很多元化的餐廳呢!本店位於北埔口附近的南興街上，本店面前還有一頭二十年歷史的木雕水牛在此歡迎大家光臨!店內裝潢古色古香，每桌都鋪上油桐花的客家布，讓顧客在享用客家美食的同時別有一番感受。",
         "03-5801099",
         "https://www.facebook.com/%E7%A6%8F%E7%BE%8E%E8%BB%92%E9%A3%B2%E9%A3%9F%E5%BA%97-1567804256665437",
         24.7011162,
         121.0572135,
         "https://hcparking.jotangi.net/beipu_web/shop-single.php?pno=C0001",
         "238"),
        ("登富茶坊客家菜",
         "新竹縣北埔鄉北埔街34號",
         "創立於2003年的『登富茶坊』位於新竹北埔老街上，提供擂茶套餐、精緻客家菜，餐點美味精緻，乾淨舒適的品茶空間搭配輕音樂，讓平常忙碌的客人感受輕鬆無壓力的氣氛。",
         "03-5802230",
         "https://www.facebook.com/dengfood/",
         24.6998455,
         121.0568801,
         "",
         ""),
        ("姜太公柿餅農產商行",
         "新竹縣北埔鄉廟前街24號",
         "過了9月霜降後新竹吹起俗稱的「九降風」，也就是強烈的東北季風，秋天是柿餅的季節，故事就從一棵柿子樹開始。傳承於姜家老宅的果樹北埔的第一棵柿子樹，是當年姜家祖先飄洋過海來台灣，辛苦抵達新竹開墾時帶來的，隨著姜家人一代代生活下去，這棵樹也落地生根，種在姜家老宅「天水堂」裡，之後分枝散葉流傳在北埔各地栽種生長，也促成了北埔柿子產業蓬勃發展。秋季時將摘下的柿青（剛成熟的柿子，味道苦澀）製作成柿餅享用。直到九二一大地震那年，災後政府為了振興產業，鼓勵地方觀光並推行「一鄉一特色」，展現地方上的農產品特色，柿餅便成了北埔的招牌之一，便成立了「姜太公柿餅農產商行」。取名姜太公柿餅，則有「姜太公釣魚，願者上鉤」的含意，店裡大方提供顧客試吃，讓客人自行比較石柿、四周柿、筆柿、牛心柿4種柿餅口感，喜歡再買，客人往往一試成主顧。",
         "0954-079-958",
         "https://www.facebook.com/LordJiangsPersimmonCake.TW",
         24.6996937,
         121.0575699,
         "https://hcparking.jotangi.net/beipu_web/shop-single.php?pno=A0004",
         "226"),
        ("北埔擂茶堂",
         "新竹縣北埔鄉廟前街4-1號",
         "我們店內提供現炒蔬食套餐、下午茶、擂茶DIY有空到北埔玩，記得來北埔擂茶堂走走、坐坐喔",
         "03-5803181",
         "https://www.facebook.com/beipuleicha",
         24.6988772,
         121.0575509,
         "",
         "245"),
        ("山水屋民宿",
         "新竹縣北埔鄉南坑村大南坑7-7號",
         "山水屋簡餐咖啡民宿、為一處結合住宿、用餐的全方位的休閒空間。以歐式風格為設計主軸，搭配寬敞的綠意庭園和典雅的古堡式建築，展現歐洲鄉野的寧靜與愜意",
         "03-5802888",
         "https://www.facebook.com/%E5%B1%B1%E6%B0%B4%E5%B1%8B-168487813337519",
         24.65305,
         121.043434,
         "",
         "243"),
        ("清香麵店",
         "新竹縣北埔鄉正德街9號",
         "因為家裡有两個身心障礙的小孩深深體會到身障家庭的辛苦付出所以本店有提供愛心麵給有需要的身障朋友們享用",
         "03-5803367",
         "https://www.facebook.com/pages/%E5%8C%97%E5%9F%94%E6%B8%85%E9%A6%99%E9%BA%B5%E5%BA%97/1962267410768913/",
         24.700891,
         121.056222,
         "",
         ""),
        ("北埔廟前粄條",
         "新竹縣北埔鄉北埔街13號",
         "1989年 原店名為”北埔粄條”由一對台鐵退休夫婦回鄉成立，是北埔地區首家以“北埔粄條”為名號的店家現在年輕的一代接手父母的手藝用傳統、簡單的方式調味用友善、熱忱的服務招待著到訪的客人",
         "0939-135-080",
         "https://www.facebook.com/beiupumb/",
         24.699669,
         121.0575692,
         "",
         ""),
        ("璞鈺擂茶",
         "新竹縣北埔鄉廟前街8號",
         "璞鈺將傳統擂茶摻入現代人的健康需求，開發出無糖、紅棗、漢方、綠茶、杏仁、松子、咖啡、咖啡杏仁、山葯薏仁、鹹味精力湯及養生精力湯十二種新口味夾鏈袋包裝，其中無糖口味上市後普獲好評，造福無數忌口的消費者。",
         "03-5802250",
         "https://www.facebook.com/hakka.letea",
         24.6990496,
         121.0575657,
         "",
         ""),
        ("哈客愛擂茶",
         "新竹縣北埔鄉北埔村中豐路30號",
         "哈客愛是位在“新竹北埔“的擂茶名店，多年來不斷地推廣客家的擂茶文化，擁有自己的工廠自產自銷，嚴選優質的天然食材製作，將傳統的擂茶創新出不同的新滋味，打造擂茶的首選品牌。",
         "03-5803969",
         "https://www.facebook.com/hakkalove",
         24.6973352,
         121.0348502,
         "https://hcparking.jotangi.net/beipu_web/shop-single.php?pno=B0007",
         ""),
        ("大豐收庭苑餐館",
         "新竹縣北埔鄉中正路30號之1",
         "(一)【大豐收庭苑餐館】門店位於新竹北埔老街，由鄭建卿小姐（陸籍外配，食材料理）與夫婿陳文忠先生（門店管理及帳務）共同經營，建築主體為舊教堂裝修而成（月租金3萬元），用餐空間雖沒有華麗裝潢，但環境整齊、乾淨、古樸，是個舒適用餐空間，可同時容納50人。餐館前院即為停車場，停車便利。屬客家家常料理，以剁椒魚頭及胡椒鴨為招牌菜，胡椒鴨由夫婿陳文忠先生之媽媽（北埔甘姐胡椒鴨）傳授，深受好評，已累積了不少忠實顧客。 (二)因食材新鮮，口味道地，加上停車便利，108年11月開業以來，生意興隆，但因Covid-19疫情影響，旅遊人潮驟降，導致營業額大幅滑落。隨著國內疫情趨緩及疫苗覆蓋率提升，旅遊人潮再現，大豐收庭苑餐館的營運應能回到昔日榮景。另藉由微創鳳凰第一次核撥的貸款（60萬元）幫助，汰換了部分生財器具，在停車便利及特色美食加持之下，【大豐收庭苑餐館】未來的營收及獲利可期。",
         "03-5805447",
         "無",
         24.7008594,
         121.0565079,
         "",
         ""),
        ("新竹北埔林 - 客家香酥脆花生小魚乾",
         "新竹縣北埔鄉北埔村正德街20號",
         "我懷孕時，醫生說要多吃小魚乾補充鈣質，回娘家，父親就做了這道我最愛的客家料理。剛好北埔老街開始繁榮發展，因為懷孕辭去科學園區工作，無收入來源，父親先做5斤讓我試賣，沒想到遊客也愛上這個味道，從五斤，十斤開始賣，晃眼三個兒子相繼出生，漸漸的做到全台宅配，客人各自帶出國當伴手禮，賣到現在已有25年，父母親皆是廚師，而我這個女兒也受父母引響學會手藝，靠著信用與真材實料繼續經營",
         "0919-970-172",
         "https://www.facebook.com/beipulin",
         24.7013272,
         121.0560269,
         "",
         ""),
        ("秀汶水",
         "新竹縣北埔鄉北埔街22~2號(南興街102號對面)",
         "傳統客家美食，堅持採用純米製作，真材實料，無添加防腐劑，百分百純手工。",
         "03-5802718",
         "無",
         24.7001867,
         121.0571086,
         "",
         "232"),
        ("茶米二十二",
         "新竹縣北埔鄉南興街67號",
         "民國88年春，老闆受農會總幹事建議開設第一家擂茶專賣店，將原本是居家的一道餐食推廣出來，經過媒體的廣為報導，使擂茶成為客家族群代表性茶飲，逐漸成為北埔一遊的必buy體驗遊程，也成為許多常客的日常早餐或午茶，並且是客委會許多活動中代表性的客家茶。",
         "03-5801409",
         "https://www.facebook.com/%E8%8C%B6%E7%B1%B3%E4%BA%8C%E5%8D%81%E4%BA%8C%E5%8C%97%E5%9F%94%E6%93%82%E8%8C%B6%E5%B0%88%E8%B3%A3%E5%BA%97-821005211281114",
         24.6999202,
         121.0573116,
         "",
         "236"),
        ("泥磚屋小吃店",
         "新竹縣北埔鄉長春街113號",
         "一間保存完整的三合院古厝餐坊。擁有令人嘖嘖稱奇的百年歷史，質樸的屋頂、泥磚的牆壁、復古的窗櫺、木製的桌椅、一口百年古井，在在都顯示了歷史與歲月的痕跡。泥磚屋堅持用餐品質及衛生，廚房作業過程公開透明化。提供傳統道地客家美食、地瓜飯免費吃到飽、茶水服務，另附設大型停車場。",
         "03-5802299",
         "https://www.facebook.com/pages/%E6%B3%A5%E7%A3%9A%E5%B1%8B%E5%B0%8F%E5%90%83%E5%BA%97/173434366033057",
         24.7052558,
         121.0549552,
         "",
         ""),
        ("噹好吃鹹豬肉",
         "新竹縣北埔鄉廟前街20-10號",
         "位於新竹縣北埔鄉的噹好吃鹹豬肉，是北埔數一數二的鹹豬肉的專賣店，除遵照古法醃製外更研究出特調獨門的秘製醬料，將傳統的客家風味佳餚發揮到淋漓盡致。店家老闆說以前吃到別人做的鹹豬肉都覺得好鹹啊!自己在想如果鹹豬肉可以不要醃製的那麼鹹的話，那有更多的人會喜歡這道集祖先智慧及傳統美味的客家風味料理，就這樣自然而然地開始研究製作出附合現代人健康導向需求，配方中加入中藥香料的客家傳統美食料理---鹹豬肉。在噹好吃鹹豬肉的醃醬中就有一樣是來自老闆娘越南娘家自己種的胡椒，定時由越南寄過來，味道就是不一樣。而選用的都是新鮮且經合格認證的溫體豬肉，每天親自選購當天早上現宰的溫體豬肉，回來首先將豬肉清洗處理乾淨、以手工切割分片，再加上自行研究的獨門特調醬料去醃製，放入冷藏室繼續醃製一個星期使其入味後，放入烤箱烤熟，再加以真空包裝販售。",
         "03-5802279",
         "https://www.facebook.com/035802279.Hakka",
         24.6996141,
         121.057568,
         "",
         "225"),
        ("陳記鹹豬肉",
         "新竹縣北埔鄉大林村6鄰11-2號",
         "銘軒食品行本於本土、天然、創意理念經營，熱銷產品「陳記客家鹹豬肉」更是在未上市前經長期精心不斷的研發調配出客家元素不含人工味素、防腐劑、香精等安心食用的客家鹹豬肉。創始人係閩南人嫁到北埔的媳婦對此地客家美食深感著迷，且其夫家叔「陳記仙草」亦頗知名，遂思索研發「陳記客家鹹豬肉」為因應市場需求及本土客家特色故採用：真空包裝、客家創意禮盒設計，自用送禮兩相宜，受者溫馨送者大方。",
         "0931-984-928",
         "https://www.facebook.com/J035803399",
         24.6890758,
         121.0593087,
         "",
         ""),
        ("阿麵製麵廠",
         "新竹縣北埔鄉中豐路157號",
         "源於一對夫妻，一份傳承一份情，延續銘豐製麵廠，將傳統的製麵技術，結合新時代對於麵食的需求，以及融合在地文化，多元的發展，創立了嶄新的品牌「阿麵ArtMet」。是北埔在地的製麵廠，每天有固定的專車路線送到麵店及餐廳，在新竹麵的市場佔有一席之地，但為了讓每一個家庭也能吃到【阿麵ArtMet】，研發乾麵以嶄新的風貌，從食材的挑選，到產品的呈現，都能品出滿滿的用心，給您不只是麵食，更是天然，健康，美味，和濃濃的「阿麵ArtMet」文化.",
         "03-5803305",
         "https://www.facebook.com/%E9%98%BF%E9%BA%B5-ArtMet-638453772925085",
         24.7003561,
         121.0382114,
         "",
         ""),
        ("佐京茶陶",
         "新竹縣北埔鄉南興街63號",
         "北埔茶農第二代彭峻暘以「佐京」為號，在老街上開了一間小茶舖，裡頭除了提供旅人品玩擂茶，更努力發揚自然農法種植的膨風茶、以及熱愛的工藝創作。十八歲那年，彭峻暘為幫母親分擔勞務，在北埔陶藝家沈東寧的工作室打工，沒想到一頭栽入陶的世界。彭峻暘沖茶手法熟練，所用杯壺器皿，皆是出自自己的雙手。從粗獷的鐵釉到清潤的青瓷，以茶事為主題的創作，從泡茶的杯壺到藏茶的大甕，意在把母親栽種的茶與親自燒製的器結合起來，從滋味到品味慢慢延伸彭式茶美學。",
         "0972-145-256",
         "https://www.facebook.com/Beiputea",
         24.6995598,
         121.057344,
         "",
         "240"),
        ("隆源餅行",
         "新竹縣北埔鄉中正路16號",
         "隆源餅行頂著百年老店的金字招牌，自製自銷的各式糕餅聞名全台，販售蕃薯餅、芋仔餅、擂茶餅、綠豆凸、竹塹餅、鳳梨酥、客式喜餅等各式糕餅，料多味美、口感極佳，平日常出現門庭若市的搶購人潮，假日更是出現大排長龍，等著買各式糕餅贈送親友的盛況空前，形成一特殊景緻，甚至還有一些國外的朋友不遠千里而來，只為了那令人垂涎三尺的蕃薯餅、芋仔餅，可見隆源餅行糕餅所散發的魅力驚人、不同凡響！",
         "03-5802337",
         "https://www.facebook.com/lungyuan1871",
         24.700863,
         121.0569463,
         "",
         ""),
        ("鄒記菜包",
         "新竹縣北埔鄉中正路49號",
         "在遠離觀光客的中正路上，鄒竣宇的「鄒記菜包」以清新姿態佇立，紅磚修葺的店頭，蒸籠冒陣陣白煙，玻璃小櫃裡陳列著當日出爐的豬籠粄，純手工捏製的漂亮外型，有著不輸西洋甜點的精緻，就算當成下午茶招待貴客，也令主人家有面子。當年輕人一窩蜂搶開咖啡館、甜點店時，鄒竣宇卻選擇賣最傳統菜包，這個決定既不創意也不時髦，他自己也坦言：「這個創業當初是沒有人看好的。他們都說菜包是老人家在賣的，年輕人賣感覺怪怪的。」鄒記菜包的店齡雖然才三年，口味卻傳承慈天宮廟前的無名老攤，而奠定口味的靈魂人物就是鄒竣宇的祖母。「我們家的菜包從一顆十元賣到現在，算下來已有將近二十年歷史了。」原本只為了分擔長輩的勞務，鄒竣宇利用假日偶爾回來幫忙擺攤，沒想到無心插柳，竟讓他漸漸對傳統手製食物產生興趣。",
         "0938-590-069",
         "https://www.facebook.com/%E9%84%92%E8%A8%98%E8%8F%9C%E5%8C%85-950558021684209",
         24.700611,
         121.055987,
         "",
         "242"),
        ("阿滿水晶餃",
         "新竹縣北埔鄉光復街30號",
         "阿滿姐包水晶餃的工夫是傳承自婆婆的好手藝，由於傳統的水晶餃外皮較為生硬，在經過不斷的改良修正後，終於研發出更Q彈有嚼勁的口感 。 阿滿水晶餃好吃的祕訣就在於手工製的外皮，與謹慎掌控外皮粉漿的細節比例，並搭配新鮮特選的溫體豬前腿肉內餡，簡單用心的口味迅速征服在地人的胃，成功打響口碑，阿滿姐堅持的傳統美味更成為許多饕客到北埔必吃的美食名單之一。",
         "0935-659-363",
         "https://www.facebook.com/AManShuiJingJiao/",
         24.6991257,
         121.0563081,
         "",
         ""),
        ("陳媽媽黃金包",
         "新竹縣北埔鄉廟前街4-1號",
         "北埔鄉「陳媽媽黃金包」老闆吳碧嫦傳承母親客家米食好手藝，2007年8月她嘗試將地方盛產的南瓜打成泥，與麵粉調和成包子皮，內餡有竹筍、酸菜、菜脯等口味，取名叫「黃金包」，黃澄澄的皮好看又好吃。50歲吳碧嫦是北埔客家人，在母親吳張滿妹調教下，擅於製作蘿蔔糕、年糕、粽子等客家米食，每到年節檔期，訂單接不完。去年推出「黃金包」後，也讓「陳媽媽黃金包」很快就打響名號。吳碧嫦說，北埔出產的南瓜甜度、香氣兼具，口感鬆糯，常因生產過剩，市場價格差，不少農民拿來餵豬，讓人覺得可惜，便靈機一動，把南瓜肉連同籽打成泥，再與麵粉攪和，成為色澤澄黃的包子皮，蒸熟後口感彈牙，香味四溢。黃金包以純手工製作，內餡有竹筍、酸菜、菜脯等口味，其中竹筍口味是素食的，內含素肉條，也是最暢銷的口味，不少到北埔老街的遊客都不會錯過。吳碧嫦76歲的母親吳張滿妹在店裡也幫忙做麵皮，動作俐落。",
         "03-5802392",
         "無",
         24.6988772,
         121.0575509,
         "",
         ""),
        ("青青好農食",
         "新竹縣北埔鄉南興街142號",
         "青青好農食：青農、青創，好農、好食 幾個年輕人想用自己的雙手，完成夢想。 ・喫飯 客家餐食，現點現做好好吃，友善耕作鮮蔬菓，拙茁栽培有機香米，小農平飼農家雞蛋 ・喫茶 早午茶食，有種喝到幸福的感覺，客家擂茶，使用優質綠茶及多種米穀研磨而成。 可以單點特調～優雅享受，或著自己動手DIY，來場體驗文化之旅～ ・Tea or coffee 本地茶園當季好茶東方美人茶。現磨義式咖啡。酸甜，多滋味。100%採自新竹縣山間蜜園的香濃蜂蜜遇見在地農友友善耕作的新鮮檸檬～ ・選，好禮好物 一定要帶回家慢慢享用、客庄風情特產、小農友善鮮食。",
         "03-5803960",
         "https://www.facebook.com/profile.php?id=100064024206137",
         24.7013449,
         121.0572655,
         "",
         "246"),
        ("姜記麻糬",
         "週一 至 週日 : 新竹縣北埔鄉南興街116號 (唐山擂茶客家菜門口前)\n例假日 : 新竹縣北埔鄉廟前街8號 (璞鈺擂茶斜對面)",
         "十年前我們正式繼承媽媽的麻糬手藝，接下攤販來傳承這道地的客家精神。早期看著媽媽那辛勤的背影，為的都是要維持家計、養大我們這些小孩，後來因為年紀大了，又生病而沒辦法再繼續做生意，讓媽媽非常捨不得。於是我決定繼承媽媽，放棄我原來的管理工作，希望讓這個好吃又富有客家精神的客家麻糬繼續傳承下來，不讓它消失。本來只有原味的麻糬，在我接手後增加紫米、抹茶口味。並 且我希望讓產品多元化，於是我與一些年長者學習ㄌ其它特色美食。客家鹹甜粄、紅豆粄、艾草粄、客家菜包、蘿蔔糕、客家肉粽，希望讓更多的遊客來逛北埔老街，能吃到我們這傳承的客家美食。",
         "0963-034-684",
         "https://www.facebook.com/profile.php?id=100054300739663",
         24.7004154,
         121.0570874,
         "",
         ""),
        ("圓樓牛肉麵",
         "新竹縣北埔鄉南興村光復街30號 (北埔市場內)",
         "客家鄉鎮的傳統市場裡，除了有菜攤肉販外，不難發現市場美食小吃。本北埔公有零售市場，因建築外觀仿如客家圓樓，旁傍有集中市場，故亦統稱為圓樓市場。本店服務客層除本鄉鄉民各年齡層，亦有識途遊客光臨。營業時間分早上時段，主要服務項目有葷素粥飯小菜等，近午時段也有麵食如紅燒牛肉麵，水餃，酸辣湯等等。",
         "0933-983-203",
         "無",
         24.6990843,
         121.0561489,
         "",
         ""),
        ("SRC 北埔印象 咖啡&民宿",
         "新竹縣北埔鄉水磜村4鄰50號",
         "北埔印象咖啡／簡餐／民宿 不僅提供各式料理與咖啡、飲品，也可接受團體聚餐預約，除此之外，這裡更提供民宿可讓旅人投宿過夜，「新竹北埔民宿‧北埔印象咖啡／簡餐／民宿」內提供二至四人六人套房，房間內寬敞明亮，房型各俱特色，不論是充滿情調的開放式浴室或擺放著休憩桌椅、可欣賞戶外山景的陽台等，都令人感到放鬆舒，而房內準備著高質感的齊全備品呵護旅人，讓您能自在無拘地在「新竹北埔民宿‧北埔印象咖啡／簡餐／民宿」內渡過美好的假期！ 服務項目：新竹北埔住宿、新竹北埔民宿、新竹北埔行程建議、新竹北埔旅遊諮詢、新竹北埔餐廳、新竹北埔親子餐廳、新竹北埔特色餐廳",
         "0933-823-310",
         "https://www.facebook.com/src7377dq",
         24.7123914,
         121.0621749,
         "",
         "248"),
        ("劉家柑橘園",
         "新竹縣北埔鄉埔尾村12鄰32-2號",
         "劉家柑橘園開放採果，自產自銷，無籽桶柑，顆顆鮮甜又多汁喔!",
         "0933-795-994",
         "https://www.facebook.com/%E5%8A%89%E5%AE%B6%E6%9F%91%E6%A9%98%E5%9C%92-2250952261835218",
         24.7066739,
         121.0464101,
         "",
         ""),
        ("榕樹下粄條",
         "新竹縣北埔鄉城門街59號",
         "粄條是流行於華南的客家美食，客家人將粄切成條狀加以烹煮，故稱粄條。其製作方法是將米磨成米漿，放入方形平底盤隔水蒸熟，取出放涼後切成長條狀，吃法有湯粄條、乾粄條兩種，油蔥是最重要的提香配搭，而且最好是當天做當天吃，或煮或炒，以保持有彈Ｑ的最佳口感。雖然招牌寫著50年，但這家可是從民國50年就開始，直到民國80年由第二代接手，小吃攤都是年輕面孔，現在已經傳承到第三代，一早六點開始營業到下午兩、三點就結束。",
         "03-5801469",
         "https://www.facebook.com/%E5%8C%97%E5%9F%94%E6%A6%95%E6%A8%B9%E4%B8%8B%E5%B0%8F%E5%90%83-106078950909520",
         24.7001654,
         121.0565655,
         "",
         ""),
        ("北埔水餃館",
         "新竹縣北埔鄉北埔街23號",
         "北埔水餃館的位置在老街中心點，手工水餃皮Q，水餃吃的到新鮮，讓人吃不膩！客家板條，很多客人都喜歡吃！自炸油蔥酥很香搭配板條、麵美味可佳！滷味小菜不錯喔！歡迎來北埔餃館！",
         "03-5805750",
         "無",
         24.6997146,
         121.0574379,
         "",
         "")
    ]
}

extension EMapDetailViewController {
    func openWithGoogleMap(indexPath: Int) {
        let lat = storeList[indexPath].5
        let lon = storeList[indexPath].6
        
        let urlStr = "comgooglemaps://?saddr=&daddr=\(lat),\(lon)&directionsmode=driving"
        let appStoreStr = "https://www.google.com.tw/maps/dir/?api=1&destination=\(lat),\(lon)&travelmode=driving"
        if let url = URL(string: urlStr),
           UIApplication.shared.canOpenURL(url) {
            UIApplication.shared.open(url)
        } else if let url = URL(string: appStoreStr) {
            UIApplication.shared.open(url)
        }
    }
    
    func callPhoneNumber(indexPath: Int) {
        let phoneNumber = storeList[indexPath].3
        
        if let phoneCallURL = URL(string: "tel://" + phoneNumber),
           UIApplication.shared.canOpenURL(phoneCallURL) {
            UIApplication.shared.open(phoneCallURL)
        }
    }
    
    func openWithSafariFacebook(indexPath: Int) {
        let link = storeList[indexPath].4
        
        if let url = URL(string: link) {
            let safariController = SFSafariViewController(url: url)
            present(safariController, animated: true, completion: nil)
        }
    }
    
    func openWithSafariShopLink(indexPath: Int) {
        let link = storeList[indexPath].7
        
        if let url = URL(string: link) {
            let safariController = SFSafariViewController(url: url)
            present(safariController, animated: true, completion: nil)
        }
    }
}
